tutorials/darcyBrinkmanBRNSFoam/box1D/0/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Intrinsic permeability scale [m^2]. Kozeny-Carman in updateVariables.H
// builds k0 = K * eps^3 / (1-eps)^2.
dimensions      [0 2 0 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    inlet           { type zeroGradient; }
    outlet          { type zeroGradient; }
    walls           { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
