tutorials/darcyBrinkmanBRNSFoam/box1D/0/Surf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Surf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Reactive-surface marker. Patches with type 'reactingWall' trigger BRNS.
// In this transport-only tutorial no patch is reactive.
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet           { type zeroGradient; }
    outlet          { type zeroGradient; }
    walls           { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
