tutorials/darcyBrinkmanBRNSFoam/box1D/0/eps
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// Uniform porosity (typical sandstone-ish value).
internalField   uniform 0.6;

boundaryField
{
    inlet           { type zeroGradient; }
    outlet          { type zeroGradient; }
    walls           { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
