tutorials/darcyBrinkmanBRNSFoam/box1D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Single-phase Newtonian water.
muf     muf  [1 -1 -1 0 0 0 0]  1.0e-3;   // dynamic viscosity [Pa·s]
rhof    rhof [1 -3  0 0 0 0 0]  1000;     // density [kg/m^3]

// ************************************************************************* //
